[
    {
        "name": "Basic Track Information",
        "description": "Fetches basic information about each track, including name, artist(s), and release date.",
        "file_path": "basic_track_info.sql"
    },
    {
        "name": "Artist Collaborations",
        "description": "Lists all artist collaborations and the number of tracks each collaboration appears on.",
        "file_path": "artist_collaborations.sql"
    },
    {
        "name": "Top 10 Most Streamed Tracks",
        "description": "Lists the top 10 tracks by total stream count in descending order.",
        "file_path": "top_10_streamed_tracks.sql"
    },
    {
        "name": "Average Danceability by Release Year",
        "description": "Calculates the average danceability of tracks released each year, providing a year-over-year look at this characteristic.",
        "file_path": "avg_danceability_by_year.sql"
    },
    {
        "name": "Tracks with Highest Playlist Count per Vendor",
        "description": "Finds the track(s) with the highest playlist count for each vendor, showing the most featured tracks on each platform.",
        "file_path": "top_tracks_by_playlist_count_per_vendor.sql"
    },
    {
        "name": "Tracks' average rank across all vendors' charts",
        "description": "Lists tracks and their average rank across all vendors' charts.",
        "file_path": "avg_track_rank.sql"
    },
    {
        "name": "Average Popularity (Track Count) by Release Month",
        "description": "Calculates the average number of playlist features for tracks released in each month, indicating seasonal popularity trends.",
        "file_path": "avg_popularity_by_month.sql"
    },
    {
        "name": "Top 5 Artists by Total Playlist Features",
        "description": "Identifies the top 5 artists by total playlist count across all vendors, highlighting the most consistently featured artists.",
        "file_path": "top_5_artists_by_playlist_features.sql"
    },
    {
        "name": "Year with Highest Average Chart Ranking",
        "description": "Computes the average count value in Track_Charts for each release year and returns the year with the highest average ranking, indicating the year with the highest-performing tracks.",
        "file_path": "highest_avg_chart_ranking_year.sql"
    },
    {
        "name": "Distribution of Tracks by BPM Ranges and Mode",
        "description": "Groups tracks by BPM ranges and mode, then counts tracks in each group.",
        "file_path": "bpm_range_mode_distribution.sql"
    },
    {
        "name": "Most Frequently Featured Artists in Top Chart Positions",
        "description": "Lists artists with the highest number of tracks appearing in the top 10 chart positions across all vendors.",
        "file_path": "top_artists_in_charts.sql"
    },
    {
        "name": "Correlation Analysis Between Playlist Count and Chart Ranking",
        "description": "Analyzes the correlation between playlist count and chart ranking for each track, identifying potential patterns in playlist popularity and chart success.",
        "file_path": "playlist_chart_correlation.sql"
    }
]